// ПЕРЕБИРАЮЩИЕ МЕТОДЫ

// =================================================================================================

// // map()
// const planets = ["Земля", "Марс", "Венера", "Юпитер"];

// const planetsInUpperCase = planets.map(planet => planet.toUpperCase());
// console.log(planetsInUpperCase); // ['ЗЕМЛЯ', 'МАРС', 'ВЕНЕРА', 'ЮПИТЕР']

// const planetsInLowerCase = planets.map(planet => planet.toLowerCase());
// console.log(planetsInLowerCase); // ['земля', 'марс', 'венера', 'юпитер']

// // Оригинальный массив не изменился
// console.log(planets); // ['Земля', 'Марс', 'Венера', 'Юпитер']

// // ЗАДАЧА ИЗ МАССИВА ОБЪЕКТОВ ВЫТЯНУТЬ МАССИВ ЗНАЧЕНИЙ СВОЙСТВА ИЗ ВСЕХ ОБЪЕКТОВ

// const students = [
//     { name: "Манго", score: 83 },
//     { name: "Поли", score: 59 },
//     { name: "Аякс", score: 37 },
//     { name: "Киви", score: 94 },
//     { name: "Хьюстон", score: 64 },
//   ];
  
//   const names = students.map(student => student.name);
//   console.log(names); // ['Манго', 'Поли', 'Аякс', 'Киви', 'Хьюстон']

// =================================================================================================

// flatMap()

// ЗАДАЧА
// В массиве `students` хранится список студентов со списком предметов 
// которые посещает студент в свойстве `courses`. Несколько студентов могут 
// посещать один и тот же предмет. Необходимо составить список всех предметов
//  которые посещает эта группа студентов, пока даже повторяющихся.


const students = [
    { name: "Манго", courses: ["математика", "физика"] },
    { name: "Поли", courses: ["информатика", "математика"] },
    { name: "Киви", courses: ["физика", "биология"] },
  ];
  
  students.map(student => student.courses);
  // [['математика', 'физика'], ['информатика', 'математика'], ['физика', 'биология']]
  
  students.flatMap(student => student.courses);
  // ['математика', 'физика', 'информатика', 'математика', 'физика', 'биология'];

// =================================================================================================